자바는 컴파일 시점에서 생성할 객체 타입에 대한 정보(클래스 로더에 의해 method 영역에 로드)만 보유하고, 런타임 시점에서는 객체를 heap 영역에 생성한다.



정적 바인딩(Static Binding)

변수나 메서드에 private, final, static 붙으면 정적 바인딩

동적 바인딩(Dynamic Binding)

**메서드 디스패치(Method DIspatch)**

어떤 메서드를 호출할지 결정하여 실제로 실행시키는 것

어떤 메서드를 실행시킬지 결정하고 실행시키는 과정

**정적 디스패치(Static Dispatch)**

컴파일 시점에서 컴파일러가 특정 메서드를 호출할 것이라고 명확하게 알고있는 경우

**동적 디스패치**

컴파일러가 어떤 메서드를 호출해야하는지 모르는 경우. 호출할 메서드를 런타임 시점에서 결정한다.

### Method Hiding

하위 클래스에서 상위 클래스의 정적 메서드를 똑같이 구현했을 때, 상위 클래스의 정적 메서드가 숨겨지는 것
